app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        @recipe = Recipe.all

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "recipes" ("name", "summary", "description", "created_at", "updated_at", "chef_id", "picture") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @recipe = Recipe.new(recipe_params)
        @recipe.chef = Chef.find(2)

        if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "recipes" SET "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["description", "1. Salad\r\n2.green stuff \r\n3. green sauce "], ["updated_at", "2018-09-07 21:02:24.920953"], ["id", 2]]
---
    def update
        @recipe = Recipe.find(params[:id])
        if @recipe.update(recipe_params)